In [1]:
import pandas as pd, numpy as np
from pathlib import Path
import fsspec
import pandas as pd

In [4]:
S3_STATIONS_TXT   = "s3://noaa-ghcn-pds/ghcnd-stations.txt"
S3_INVENTORY_TXT  = "s3://noaa-ghcn-pds/ghcnd-inventory.txt"
S3_BY_STATION     = "s3://noaa-ghcn-pds/csv/by_station/{id}.csv"
STOR = {"anon": True}

OUTDIR = Path('../data'); OUTDIR.mkdir(parents=True, exist_ok=True)
OUT_PARQUET = OUTDIR / '/home/pat6/ATMS-523-Final'
print('Output:', OUT_PARQUET.resolve())

Output: /home/pat6/ATMS-523-Final

In [5]:
colspecs = [(0,11),(12,20),(21,30),(31,37),(38,40),(41,71),(72,75),(76,79),(80,85)]
names = ['ID','LATITUDE','LONGITUDE','ELEVATION','STATE','NAME','GSN_FLAG','HCN_CRN_FLAG','WMO_ID']

stations = pd.read_fwf(S3_STATIONS_TXT, colspecs=colspecs, names=names, dtype={'ID':str,'STATE':str,'WMO_ID':str}, storage_options=STOR)
stations['NAME'] = stations['NAME'].str.strip(); stations['STATE'] = stations['STATE'].fillna('').str.strip()

inventory = pd.read_csv(
    S3_INVENTORY_TXT, sep=r'\s+', names=['ID','LAT','LON','ELEMENT','FIRSTYEAR','LASTYEAR'],
    dtype={'ID':str,'ELEMENT':str,'FIRSTYEAR':int,'LASTYEAR':int}, engine='python', storage_options=STOR
)

stations.head(), inventory.head()

(            ID  LATITUDE  LONGITUDE  ELEVATION STATE                   NAME  \
 0  ACW00011604   17.1167   -61.7833       10.1        ST JOHNS COOLIDGE FLD
 1  ACW00011647   17.1333   -61.7833       19.2                     ST JOHNS
 2  AE000041196   25.3330    55.5170       34.0          SHARJAH INTER. AIRP
 3  AEM00041194   25.2550    55.3640       10.4                   DUBAI INTL
 4  AEM00041217   24.4330    54.6510       26.8               ABU DHABI INTL

   GSN_FLAG HCN_CRN_FLAG WMO_ID
 0      NaN          NaN    NaN
 1      NaN          NaN    NaN
 2      GSN          NaN  41196
 3      NaN          NaN  41194
 4      NaN          NaN  41217  ,
             ID      LAT      LON ELEMENT  FIRSTYEAR  LASTYEAR
 0  ACW00011604  17.1167 -61.7833    TMAX       1949      1949
 1  ACW00011604  17.1167 -61.7833    TMIN       1949      1949
 2  ACW00011604  17.1167 -61.7833    PRCP       1949      1949
 3  ACW00011604  17.1167 -61.7833    SNOW       1949      1949
 4  ACW00011604  17.1167 -61.7833    SNWD       1949      1949)

In [6]:
fs = fsspec.filesystem('s3', **STOR)
candidates = ['USC00087205']
picked, url_map = [], {}
for sid in candidates:
    url = S3_BY_STATION.format(id=sid)
    if fs.exists(url):
        picked.append(sid); url_map[sid] = url
    if len(picked)>=4: break
print('Picked:', picked)
url_map

Picked: ['USC00087205']

{'USC00087205': 's3://noaa-ghcn-pds/csv/by_station/USC00087205.csv'}

In [9]:
def load_station_daily(url: str) -> pd.DataFrame:
    df = pd.read_csv(url, storage_options=STOR, dtype={'ID':str,'ELEMENT':str}, parse_dates=['DATE'])
    df['DATA_VALUE'] = df['DATA_VALUE'].replace(-9999, np.nan)
    wide = (df.pivot_table(index=['ID','DATE'], columns='ELEMENT', values='DATA_VALUE', aggfunc='first').reset_index())
    for c in ('TMAX','TMIN','TAVG'):
        if c in wide: wide[c] = wide[c]/10.0
    if 'PRCP' in wide: wide['PRCP'] = wide['PRCP']/10.0
    return wide.sort_values(['ID','DATE']).reset_index(drop=True)

frames = []
for sid in picked:
    w = load_station_daily(url_map[sid])
    frames.append(w); print(sid, w.shape)

daily = pd.concat(frames, ignore_index=True)
daily.head()

/tmp/ipykernel_5154/2081217567.py:2: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url, storage_options=STOR, dtype={'ID':str,'ELEMENT':str}, parse_dates=['DATE'])

USC00087205 (46166, 18)

ELEMENT,ID,DATE,DAPR,MDPR,PRCP,SNOW,SNWD,TMAX,TMIN,TOBS,WT01,WT03,WT04,WT06,WT08,WT11,WT14,WT16
0,USC00087205,1892-09-01,NaN,NaN,NaN,NaN,NaN,32.2,20.6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,USC00087205,1892-09-02,NaN,NaN,NaN,NaN,NaN,31.7,20.6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,USC00087205,1892-09-03,NaN,NaN,NaN,NaN,NaN,31.7,21.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,USC00087205,1892-09-04,NaN,NaN,NaN,NaN,NaN,32.2,21.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,USC00087205,1892-09-05,NaN,NaN,NaN,NaN,NaN,33.3,21.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [65]:
daily.to_csv('final_data.csv',index=False)

In [48]:
daily['month'] = daily['DATE'].dt.month
daily['year'] = daily['DATE'].dt.year

daily_sub = (daily[(daily['DATE'] >= '1991-01-01') & 
                   (daily['DATE'] <= '2020-12-31') &
                   (daily['month'].isin([10,11,12,1]))]).copy()
# drop na where TMIN is na
daily_sub_cln = daily_sub[daily_sub['TMIN'].notna()].copy()

### Average days per month below 32°F

In [54]:
#find number average days per month <= frost(32F Oc)
frost_df = (daily_sub_cln[daily_sub_cln['TMIN'] <=0]
           [['TMIN','year','month']].groupby(['year','month'])
           .count().reset_index()[['month','TMIN']]
           .groupby('month').mean().reset_index())

In [63]:
frost_df.rename(columns={'TMIN':'Avg_days_per_month'},inplace=True)
frost_df

ELEMENT  month  Avg_days_per_month
0            1            2.800000
1           11            1.000000
2           12            2.571429

### Average days per month below 28°F

In [59]:
#find number average days per month <= freeze(28F Oc)
freeze_df = (daily_sub_cln[daily_sub_cln['TMIN'] <=-2.2]
           [['TMIN','year','month']].groupby(['year','month'])
           .count().reset_index()[['month','TMIN']]
           .groupby('month').mean().reset_index())

In [64]:
freeze_df.rename(columns={'TMIN':'Avg_days_per_month'},inplace=True)
freeze_df

ELEMENT  month  Avg_days_per_month
0            1            1.583333
1           12            3.000000

# Part Two

In [87]:

url = "https://www.cpc.ncep.noaa.gov/data/indices/sstoi.indices"
cols = ['yr','month','NINO1+2',	'NINO1+2_ANOM','NINO3',	'NINO3_ANOM',
        'NINO4', 'NINO4_ANOM', 'NINO3.4', 'NINO3.4_ANOM']

enso_df = pd.read_csv(url,delim_whitespace=True,header=0,
                      na_values=["-99.99", "-99.9", "-9.99"],
                      names=cols)
enso_df.dropna(inplace=True)
enso_df.rename(columns={'yr':'year'},inplace=True)
enso_df.head()

/tmp/ipykernel_5154/814035489.py:5: FutureWarning: The 'delim_whitespace' keyword in pd.read_csv is deprecated and will be removed in a future version. Use ``sep='\s+'`` instead
  enso_df = pd.read_csv(url,delim_whitespace=True,header=0,

,year,month,NINO1+2,NINO1+2_ANOM,NINO3,NINO3_ANOM,NINO4,NINO4_ANOM,NINO3.4,NINO3.4_ANOM
0,1982,1,24.28,-0.24,25.84,0.17,28.01,-0.21,26.65,0.08
1,1982,2,25.38,-0.72,26.26,-0.11,27.99,-0.11,26.54,-0.20
2,1982,3,25.22,-1.38,26.92,-0.25,28.18,-0.05,27.09,-0.14
3,1982,4,24.57,-1.16,27.52,-0.05,28.61,0.10,27.83,0.02
4,1982,5,24.00,-0.62,27.70,0.49,29.19,0.40,28.37,0.49

In [86]:
freeze_events_df = (daily_sub_cln[daily_sub_cln['TMIN'] <=-2.2]
                   [['TMIN','year','month']].groupby(['year','month'])
                   .count()).reset_index()
freeze_events_df.rename(columns={'TMIN':'count'},inplace=True)
freeze_events_df.head()

ELEMENT  year  month  count
0        1992      1      1
1        1995     12      3
2        1996      1      1
3        1997      1      1
4        1999      1      3

In [88]:
tot_df = pd.merge(freeze_events_df,enso_df[['year','month','NINO1+2_ANOM',
                                            'NINO3_ANOM','NINO4_ANOM',
                                            'NINO3.4_ANOM']],
                 how='left',on=['year','month'])

In [89]:
tot_df

    year  month  count  NINO1+2_ANOM  NINO3_ANOM  NINO4_ANOM  NINO3.4_ANOM
0   1992      1      1          0.07        1.18        0.58          1.67
1   1995     12      3         -0.86       -0.96       -0.48         -0.91
2   1996      1      1         -0.69       -0.71       -0.48         -0.83
3   1997      1      1         -0.93       -0.98       -0.10         -0.61
4   1999      1      3         -0.69       -1.15       -1.67         -1.58
5   2001      1      1         -0.37       -0.43       -0.91         -0.76
6   2002      1      1         -0.58       -0.65        0.38         -0.20
7   2003      1      1         -0.05        0.67        0.64          0.88
8   2008      1      1         -0.26       -1.35       -1.44         -1.59
9   2009      1      1         -0.16       -0.35       -0.84         -0.80
10  2010      1      5          0.00        1.06        1.16          1.53
11  2010     12      3         -1.20       -1.29       -1.14         -1.21
12  2014      1      1          0.19       -0.20       -0.32         -0.49
13  2018      1      2         -0.74       -1.09       -0.20         -0.70